Revit 2027 API
BuiltInFailures.ElectricalFailures.MaximumNumberOfPolesExceeded Property
 You cannot add more poles to this spare, as doing so would exceed the maximum number of poles set for this equipment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MaximumNumberOfPolesExceeded { get; }
Public Shared ReadOnly Property MaximumNumberOfPolesExceeded As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MaximumNumberOfPolesExceeded {
	FailureDefinitionId^ get ();
}
static member MaximumNumberOfPolesExceeded : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace